
# config.py
BOT_TOKEN = "8758603851:AAEnTPgLqrDmRqie4Tcgq5Nm2-LuOqGwMhk"
WEBAPP_URL = "https://sched.murcielago.pro" # URL вашего веб-приложения (нужен HTTPS)
WEBAPP_PORT = 5000

BASE_URL = "https://oreluniver.ru"
SCHEDULE_URL = "https://oreluniver.ru/schedule"

# Институты/факультеты
FACULTIES = {
    "5": "АСИ",
    "152": "ИЕНиБ",
    "11": "ИЕНиБ",
    "12": "ИВЗО",
    "164": "Иняз",
    "157": "ИПиП",
    "7": "ИПАИТ",
    "154": "ИФил",
    "289": "ИЭиУ",
    "167": "ИстФак",
    "488": "ЛФ",
    "464": "Ординатура",
    "149": "ПО ФПИС",
    "124": "ПТИ",
    "145": "УПКВК",
    "158": "ФПСиФ",
    "163": "ФТПиС",
    "26": "ФФКС",
    "150": "ФизМат",
    "153": "Филос",
    "159": "ХГФ",
    "155": "ЮИ",
    "2": "ЮИ",
}

FACULTY_FULL_NAMES = {
    "5": "Архитектурно-строительный институт",
    "152": "Институт естественных наук и биотехнологии",
    "11": "Институт естественных наук и биотехнологии",
    "12": "Институт заочного и очно-заочного образования",
    "164": "Институт иностранных языков",
    "157": "Институт педагогики и психологии",
    "7": "Институт приборостроения, автоматизации и информационных технологий",
    "154": "Институт филологии",
    "289": "Институт экономики и управления",
    "167": "Исторический факультет",
    "488": "Лечебный факультет",
    "464": "Отдел ординатуры",
    "149": "Подготовительное отделение ФПИС",
    "124": "Политехнический институт имени Н.Н. Поликарпова",
    "145": "Управление подготовки кадров высшей квалификации",
    "158": "Факультет педиатрии, стоматологии и фармации",
    "163": "Факультет технологии, предпринимательства и сервиса",
    "26": "Факультет физической культуры и спорта",
    "150": "Физико-математический факультет",
    "153": "Философский факультет",
    "159": "Художественно-графический факультет",
    "155": "Юридический институт",
    "2": "Юридический институт",
}

PAIR_TIMES = {
    1: "8:30 – 10:00",
    2: "10:10 – 11:40",
    3: "12:00 – 13:30",
    4: "13:40 – 15:10",
    5: "15:20 – 16:50",
    6: "17:00 – 18:30",
    7: "18:40 – 20:10",
    8: "20:20 – 21:50",
}

DAYS_OF_WEEK = ["Понедельник", "Вторник", "Среда", "Четверг", "Пятница", "Суббота"]